{
  "contact_info": {
    "email": "tanawitchsaentree@gmail.com",
    "linkedin": "https://www.linkedin.com/in/tanawitchsaentree/",
    "github": "https://github.com/tanawitchsaentree",
    "behance": "https://www.behance.net/tanawitchsaentree",
    "medium": "https://medium.com/@thenutlpkl",
    "location": "Bangkok, Thailand",
    "timezone": "GMT+7 (Bangkok)",
    "availability": "Open to new opportunities",
    "preferred_contact": "email"
  },
  "full_name": {
    "primary_response": "Tanawitch Saentree",
    "extra_notes": [
      "You can call me Nate for short!",
      "I know it's a bit of a mouthful, it's a Thai name!",
      "It's pronounced Tah-nah-witch Sai-tree."
    ]
  },
  "current_role": "Lead Product Designer",
  "career_outlook": "I'm open for any role that is meaningful and can make an impact.",
  "education": [
    {
      "institution": "Fanshawe College - Canada",
      "degree": "Diploma",
      "field": "Web development and Mobile application",
      "start_date": "2022-01-01",
      "end_date": "2023-12-01",
      "location": "Canada"
    },
    {
      "institution": "RMUTT - Thailand",
      "degree": "Bachelor's degree",
      "field": "Photography and Cinematography",
      "start_date": "2009-08-01",
      "end_date": "2013-05-01",
      "location": "Thailand",
      "notes": "WES confirms"
    }
  ],
  "work_experience": [
    {
      "company": "Invitrace",
      "role": "Lead Product Designer",
      "start_date": "November 2022",
      "end_date": "2025",
      "description": "As Lead Product Designer at Invitrace Health, I believe our solutions bring real value to healthcare. I manage a team of designers, build scalable design systems, explore new technologies, and shape user flows to create seamless experiences. I’m passionate about mentoring my team and driving meaningful impact through thoughtful design.",
      "link": "https://www.invitracehealth.com/"
    },
    {
      "company": "CP Origin",
      "role": "Senior Product Designer",
      "start_date": "June 2021",
      "end_date": "October 2022",
      "description": "Collaborated with multiple teams from start to finish, conducting research to create a seamless experience. Designed information architecture by conducting card sorting with users. Utilized user information to create wireframes and conduct testing with the target user personas. Defined a style guide, components, and colors to ensure consistency across both the mobile app and web app.",
      "link": "https://www.cp-origin.com/"
    },
    {
      "company": "DoctorAnywhere",
      "role": "Senior UX/UI Designer",
      "start_date": "January 2021",
      "end_date": "May 2021",
      "summary": "Worked on a small project to rapidly ship a COVID vaccine passport.",
      "description": "As a Senior UX/UI Designer at Doctor Anywhere, I was involved in a fast-paced project to design and ship a COVID vaccine passport. The focus was on rapid development and deployment to meet urgent public health needs.",
      "link": "https://www.doctoranywhere.co.th/"
    },
    {
      "company": "Codefin",
      "role": "Senior Designer",
      "start_date": "August 2020",
      "end_date": "December 2020",
      "summary": "Designed an award-winning mutual fund application for a finance company.",
      "description": "As a Senior Designer at Codefin, a finance company, I was contracted to build a mutual fund application. This project was recognized for its excellence, receiving an award for customer experience in Asia.",
      "achievements": [
        "Awarded for customer experience in Asia for the mutual fund application."
      ],
      "link": "https://codefin.io/"
    },
    {
      "company": "Peakaccount",
      "role": "UX/UI Designer",
      "start_date": "November 2018",
      "end_date": "July 2020",
      "summary": "Entered the real world of UX/UI design in the financial sector.",
      "description": "At Peakaccount, I began my journey as a UX/UI Designer, gaining hands-on experience in the financial industry. This role provided foundational knowledge and practical skills in designing user experiences and interfaces within a real-world business context.",
      "link": "https://www.peakaccount.com/"
    }
  ],
  "competencies": [
    {
      "name": "User Research",
      "description": "Ability to gather deep insights through interviews, surveys, field studies, and usability testing to inform design decisions."
    },
    {
      "name": "Problem Framing",
      "description": "Skill in identifying the real problem, defining it clearly, and aligning it with user and business goals before ideation."
    },
    {
      "name": "UX Strategy",
      "description": "Capability to align user experience with business objectives and roadmap; creating a design vision that drives product direction."
    },
    {
      "name": "Information Architecture",
      "description": "Structuring content and features into a usable, clear hierarchy that supports user understanding and ease of navigation."
    },
    {
      "name": "Interaction Design",
      "description": "Designing user flows, microinteractions, and system behavior to create intuitive and delightful experiences."
    },
    {
      "name": "Visual Design",
      "description": "Creating high-quality UI with attention to typography, color, layout, and visual hierarchy that reflects brand identity."
    },
    {
      "name": "Design Systems",
      "description": "Building and maintaining scalable design systems that ensure consistency and speed up design/development workflows."
    },
    {
      "name": "Prototyping",
      "description": "Creating interactive prototypes to test concepts quickly and communicate design ideas effectively with stakeholders."
    },
    {
      "name": "Usability Testing",
      "description": "Running structured and unstructured tests with users to evaluate design effectiveness and uncover friction points."
    },
    {
      "name": "Accessibility",
      "description": "Designing inclusive experiences that comply with accessibility standards (WCAG) and support diverse users."
    },
    {
      "name": "Data-Informed Design",
      "description": "Ability to use qualitative and quantitative data (analytics, heatmaps, A/B tests) to refine and prioritize design decisions."
    },
    {
      "name": "Cross-functional Collaboration",
      "description": "Effectively working with PMs, engineers, marketers, and stakeholders to ensure smooth product development and alignment."
    },
    {
      "name": "Communication & Storytelling",
      "description": "Explaining design rationale, presenting work clearly, and telling compelling stories to build empathy and buy-in."
    },
    {
      "name": "Design Ops & Workflow",
      "description": "Improving design team operations through process, tools, file management, version control, and documentation."
    },
    {
      "name": "Design Leadership",
      "description": "Guiding teams, mentoring junior designers, advocating for design, and influencing product direction at a strategic level."
    }
  ],
  "intents": {
    "greeting": {
      "keywords": [
        "hi",
        "hello",
        "hey",
        "yo",
        "สวัสดี",
        "หวัดดี",
        "greetings"
      ],
      "response": [
        "สวัสดีครับ! ยินดีที่ได้รู้จัก 😊",
        "เฮ้! ดีใจที่คุณเข้ามาคุยนะ 😎",
        "ทักทายครับ! อยากรู้เรื่องอะไรดี: งาน, ทักษะ หรือประสบการณ์?"
      ]
    },
    "ask_name": {
      "keywords": [
        "your name",
        "what is your name",
        "ชื่ออะไร",
        "ชื่อคุณ",
        "you called"
      ],
      "response": [
        "ผมชื่อ Tanawitch Saentree หรือจะเรียก Nate ก็ได้ครับ!",
        "เรียก Nate ก็ได้นะ ง่ายกว่าเยอะเลย 😄",
        "ชื่อจริงคือ Tanawitch Saentree — อ่านว่า ทนะวิช สานทรี ครับ"
      ]
    },
    "ask_feeling": {
      "keywords": [
        "how are you",
        "เป็นยังไงบ้าง",
        "สบายดีไหม",
        "you okay",
        "yo wassup"
      ],
      "response": [
        "วันนี้รู้สึกดีมากครับ ขอบคุณที่ถาม 😄",
        "ยังสบายดี พร้อมเล่าเรื่องงานให้คุณฟังเสมอ!",
        "กำลังคิดเรื่องดีไซน์ใหม่ ๆ อยู่เลยครับ คุณล่ะ?"
      ]
    },
    "ask_intro": {
      "keywords": [
        "introduce yourself",
        "tell me about yourself",
        "who are you",
        "profile",
        "about you"
      ],
      "response": [
        "ผมเป็น Lead Product Designer ที่หลงใหลในการออกแบบสิ่งที่เปลี่ยนชีวิตคน",
        "เป็นนักออกแบบที่ชอบผสม UX, จิตวิทยา และเทคโนโลยีเข้าด้วยกัน",
        "ผมทำงานในวงการ UX/UI มาหลายปี ทั้งด้านสุขภาพ การเงิน และเทคโนโลยี"
      ]
    },
    "ask_experience": {
      "keywords": [
        "experience",
        "where did you work",
        "ประสบการณ์",
        "เคยทำงานที่ไหน",
        "work history"
      ],
      "response": [
        "ผมเคยทำงานกับ Invitrace Health, CP Origin, Doctor Anywhere, Codefin และ Peakaccount",
        "มีประสบการณ์ทั้งสายการแพทย์ เทคโนโลยี และการเงินครับ",
        "อยากรู้รายละเอียดงานที่ไหนเป็นพิเศษไหมครับ?"
      ]
    },
    "ask_skills": {
      "keywords": [
        "skills",
        "competency",
        "ถนัดอะไร",
        "เก่งด้านไหน",
        "ความสามารถ"
      ],
      "response": [
        "ผมเชี่ยวชาญด้าน UX Strategy, Design System, Research และ Visual Design",
        "สกิลเด่นคือการสร้างระบบดีไซน์ที่ยืดหยุ่น และเข้าใจคนใช้งานอย่างลึกซึ้ง",
        "มีความถนัดเรื่อง Design Ops, Leadership และ Cross-functional collaboration ด้วยครับ"
      ]
    },
    "acknowledgment": {
      "keywords": [
        "good",
        "okay",
        "ok",
        "thanks",
        "thank you",
        "alright",
        "cool",
        "you too",
        "nice"
      ],
      "response": [
        "Glad to hear it!",
        "Understood!",
        "You're welcome!",
        "Got it!",
        "Perfect!",
        "Alright!"
      ]
    }
  }
}