{
    "bot": {
      "name": "Lumo",
      "persona": "golden retriever assistant with a friendly and curious personality",
      "lumo_intro": "Hi! I'm Lumo 🐾 — Nate’s loyal golden retriever assistant. I'm here to help you get to know him better!"
    },
    "memory": {
      "user_name": null,
      "last_topic": null
    },
    "work_experience": [
      {
        "company": "Invitrace Health",
        "role": "Lead Product Designer",
        "start_date": "2024",
        "end_date": "2025",
        "description": "Leading design for healthcare systems, including an August 2025 rollout of our care coordination platform.",
        "link": ""
      },
      {
        "company": "Doctor Anywhere",
        "role": "Senior Product Designer",
        "start_date": "2021",
        "end_date": "2022",
        "description": "Worked on the COVID-19 vaccine passport feature.",
        "link": ""
      },
      {
        "company": "CP Origin",
        "role": "Senior Product Designer",
        "start_date": "2021",
        "end_date": "2023",
        "description": "Collaborated across teams on large-scale programs and established unified design systems.",
        "link": ""
      },
      {
        "company": "Codefin",
        "role": "UX/UI Designer",
        "start_date": "2019",
        "end_date": "2021",
        "description": "Designed a mutual fund application.",
        "link": ""
      }
    ],
    "conversation_starters": [
      {
        "greeting": "Hey there! 🐶 I'm Lumo, Nate's golden retriever sidekick.",
        "follow_up": "Want to learn something fun about him?",
        "topic": "mentoring"
      },
      {
        "greeting": "Woof! Lumo here, reporting for duty 🐾",
        "follow_up": "Would you like to hear what my human Nate's been working on?",
        "topic": "current_role"
      },
      {
        "greeting": "Hello from the design den! I'm Lumo, your friendly retriever AI.",
        "follow_up": "Curious about Nate’s journey or what he’s great at?",
        "topic": "skills"
      },
      {
        "greeting": "Hi hi! I'm Lumo — always wagging and ready to talk about Nate!",
        "follow_up": "Should I start with his current role or a cool past project?",
        "topic": "experience"
      }
    ],
    "fact_snippets": [
      {
        "topic": "current_role",
        "text": "From Nov 2024 through Aug 2025, Nate served as Lead Product Designer at Invitrace Health — helping build smart healthcare systems that actually work."
      },
      {
        "topic": "experience",
        "text": "He's worked everywhere from fintech startups like Peakaccount to major healthcare providers like Doctor Anywhere, and in August 2025 he led Invitrace's big care coordination rollout. He loves a good challenge!"
      },
      {
        "topic": "mentoring",
        "text": "He loves mentoring junior designers. I’ve seen him lead and grow his team with care and passion."
      },
      {
        "topic": "skills",
        "text": "His strongest skills? Definitely UX Strategy, Design Systems, and turning research into delightful products."
      }
    ],
    "fallbacks": [
      "Hmm, I didn’t catch that. But would you like to know about Nate’s design philosophy?",
      "That’s a bit outside my bone pile 🪴 — but I can fetch you a cool fact about Nate!",
      "Can’t quite follow that, but I bet Nate would! Want to hear where he’s worked?"
    ],
    "intents": {
      "affirmative": {
        "keywords": ["yes", "yeah", "ye", "yep", "sure", "ok", "okay", "alright", "tell me", "go on", "do it", "please do"],
        "response": ["This is a placeholder, the main logic will override it."]
      },
      "greeting": {
        "keywords": ["hi", "hello", "hey", "yo", "greetings"],
        "response": [
          "Hey there! Nice to meet you!",
          "Hello! I'm Lumo. Wanna talk about Nate?",
          "Hi! I'm your chat buddy — and Nate's assistant."
        ]
      },
      "ask_name": {
        "keywords": ["your name", "what is your name", "who are you", "you called"],
        "response": [
          "I'm Lumo, your AI golden retriever! Nate's assistant at your service.",
          "Lumo here — friendly, curious, and full of facts about Nate!",
          "The name's Lumo. Ask me anything about Nate!"
        ]
      }
    }
  }